In [74]:
import pandas as pd
import numpy as np

# 多行索引

In [75]:
df = pd.read_csv('D:\\vscode_code\\数据集\\learn_pandas.csv')

In [76]:
np.random.seed(0)
# MultiIndex 类
#创建一个行索引
multi_index = pd.MultiIndex.from_product(
    [list('ABCD'),df.Gender.unique()],
    names = ('School','Gender')
)
multi_index

MultiIndex([('A', 'Female'),
            ('A',   'Male'),
            ('B', 'Female'),
            ('B',   'Male'),
            ('C', 'Female'),
            ('C',   'Male'),
            ('D', 'Female'),
            ('D',   'Male')],
           names=['School', 'Gender'])

In [77]:
# 创建一个列索引
multi_column = pd.MultiIndex.from_product(
    [['Height','Weight'],df.Grade.unique()],
    names = ('test','Grade')
)
multi_column

MultiIndex([('Height',  'Freshman'),
            ('Height',    'Senior'),
            ('Height', 'Sophomore'),
            ('Height',    'Junior'),
            ('Weight',  'Freshman'),
            ('Weight',    'Senior'),
            ('Weight', 'Sophomore'),
            ('Weight',    'Junior')],
           names=['test', 'Grade'])

In [78]:
# 创建一个DF，将multi_index、multi_column组装进去
df_multi = pd.DataFrame(np.c_[(np.random.randn(8,4)*5 + 163).tolist(),(np.random.randn(8,4)*5 +65).tolist()],
                        index = multi_index,
                        columns  = multi_column).round(1)
df_multi

test            Height                           Weight                   \
Grade         Freshman Senior Sophomore Junior Freshman Senior Sophomore
School Gender
A      Female    171.8  165.0     167.9  174.2     60.6   55.1      63.3
       Male      172.3  158.1     167.8  162.2     71.2   71.0      63.1
B      Female    162.5  165.1     163.7  170.3     59.8   57.9      56.5
       Male      166.8  163.6     165.2  164.7     62.5   62.8      58.7
C      Female    170.5  162.0     164.6  158.7     56.9   63.9      60.5
       Male      150.2  166.3     167.3  159.3     62.4   59.1      64.9
D      Female    174.3  155.7     163.2  162.1     65.3   66.5      61.8
       Male      170.7  170.3     163.8  164.9     61.6   63.2      60.9

test
Grade         Junior
School Gender
A      Female   65.8
       Male     63.5
B      Female   74.8
       Male     68.9
C      Female   66.9
       Male     67.1
D      Female   63.2
       Male     56.4

In [79]:
# 查看行索引的名称
# index属性:查看行索引
# names: 索引的名称
df_multi.index.names

FrozenList(['School', 'Gender'])

In [80]:
# 查看列索引的名称
df_multi.columns.names

FrozenList(['test', 'Grade'])

In [81]:
# 查看行索引的值
df_multi.index.values

array([('A', 'Female'), ('A', 'Male'), ('B', 'Female'), ('B', 'Male'),
       ('C', 'Female'), ('C', 'Male'), ('D', 'Female'), ('D', 'Male')],
      dtype=object)

In [82]:
# 查看列索引的值
df_multi.columns.values

array([('Height', 'Freshman'), ('Height', 'Senior'),
       ('Height', 'Sophomore'), ('Height', 'Junior'),
       ('Weight', 'Freshman'), ('Weight', 'Senior'),
       ('Weight', 'Sophomore'), ('Weight', 'Junior')], dtype=object)

In [83]:
#获取行索引的第一层的索引
# get_level_values
df_multi.index.get_level_values(0)

Index(['A', 'A', 'B', 'B', 'C', 'C', 'D', 'D'], dtype='object', name='School')

# 多层索引的loc索引

In [84]:
df_demo = df[['School','Grade']]
df_demo.head()

  School      Grade
0      A   Freshman
1      B   Freshman
2      A     Senior
3      C  Sophomore
4      C  Sophomore

In [85]:
df_multi = df.set_index(['School','Grade'])
df_multi.head()

                            Name  Gender  Height  Weight Transfer  \
School Grade
A      Freshman     Gaopeng Yang  Female   158.9    46.0        N
B      Freshman   Changqiang You    Male   166.5    70.0        N
A      Senior            Mei Sun    Male   188.9    89.0        N
C      Sophomore    Xiaojuan Sun  Female     NaN    41.0        N
       Sophomore     Gaojuan You    Male   174.0    74.0        N

                  Test_Number  Test_Date Time_Record
School Grade
A      Freshman             1  2019/10/5     0:04:34
B      Freshman             1   2019/9/4     0:04:20
A      Senior               2  2019/9/12     0:05:22
C      Sophomore            2   2020/1/3     0:04:08
       Sophomore            2  2019/11/6     0:05:22

In [86]:
df_multi = df_multi.sort_index()
df_multi

                            Name  Gender  Height  Weight Transfer  \
School Grade
A      Freshman     Gaopeng Yang  Female   158.9    46.0        N
       Freshman        Qiang Chu  Female   162.5    52.0        N
       Freshman    Xiaopeng Zhou    Male   174.1    74.0        N
       Freshman       Yanpeng Lv    Male     NaN    65.0        N
       Freshman    Xiaopeng Zhao  Female   161.0    53.0        N
...                          ...     ...     ...     ...      ...
D      Sophomore       Feng Qian  Female   156.4    43.0        N
       Sophomore          Li Qin    Male     NaN    76.0        N
       Sophomore     Yanjuan You    Male     NaN    55.0        N
       Sophomore  Xiaoqiang Qian    Male   170.5    73.0        N
       Sophomore     Chunpeng Lv    Male   155.7    51.0        N

                  Test_Number   Test_Date Time_Record
School Grade
A      Freshman             1   2019/10/5     0:04:34
       Freshman             1  2019/12/12     0:03:53
       Freshman             1   2019/9/29     0:05:16
       Freshman             1  2019/11/17     0:04:13
       Freshman             3   2019/9/25     0:05:13
...                       ...         ...         ...
D      Sophomore            2   2019/11/5     0:05:07
       Sophomore            3    2020/1/7     0:05:19
       Sophomore            1  2019/11/23     0:03:50
       Sophomore            3   2019/10/3     0:04:11
       Sophomore            1   2019/11/6     0:05:05

[200 rows x 8 columns]

In [87]:
# 查看特定行的值
df_multi.loc[('A','Freshman')].head()

                          Name  Gender  Height  Weight Transfer  Test_Number  \
School Grade
A      Freshman   Gaopeng Yang  Female   158.9    46.0        N            1
       Freshman      Qiang Chu  Female   162.5    52.0        N            1
       Freshman  Xiaopeng Zhou    Male   174.1    74.0        N            1
       Freshman     Yanpeng Lv    Male     NaN    65.0        N            1
       Freshman  Xiaopeng Zhao  Female   161.0    53.0        N            3

                  Test_Date Time_Record
School Grade
A      Freshman   2019/10/5     0:04:34
       Freshman  2019/12/12     0:03:53
       Freshman   2019/9/29     0:05:16
       Freshman  2019/11/17     0:04:13
       Freshman   2019/9/25     0:05:13

In [88]:
# 选择A和B中的Freshman
df_multi.loc[[('A','Freshman'),('B','Sophomore')]].head(20)

                           Name  Gender  Height  Weight Transfer  Test_Number  \
School Grade
A      Freshman    Gaopeng Yang  Female   158.9    46.0        N            1
       Freshman       Qiang Chu  Female   162.5    52.0        N            1
       Freshman   Xiaopeng Zhou    Male   174.1    74.0        N            1
       Freshman      Yanpeng Lv    Male     NaN    65.0        N            1
       Freshman   Xiaopeng Zhao  Female   161.0    53.0        N            3
       Freshman     Chunli Zhao    Male   180.2    83.0        N            1
       Freshman      Peng Zhang  Female   163.1     NaN        N            3
       Freshman    Xiaoquan Sun  Female   154.6    40.0        N            3
       Freshman     Chunmei Shi  Female   164.9    52.0        N            1
       Freshman    Xiaomei Yang  Female   159.3    49.0        N            1
       Freshman   Xiaofeng Qian  Female   158.5    49.0        N            1
       Freshman     Changmei Lv    Male   172.2    75.0        N            1
       Freshman      Qiang Feng    Male   178.9    80.0        N            2
B      Sophomore    Changmei Xu  Female   151.6    43.0        N            2
       Sophomore   Xiaopeng Qin    Male   172.8     NaN        N            1
       Sophomore         Mei Xu  Female   154.2    39.0        N            2
       Sophomore    Xiaoli Zhou  Female   166.8    55.0        N            1
       Sophomore       Peng Han  Female   147.8    34.0      NaN            2

                   Test_Date Time_Record
School Grade
A      Freshman    2019/10/5     0:04:34
       Freshman   2019/12/12     0:03:53
       Freshman    2019/9/29     0:05:16
       Freshman   2019/11/17     0:04:13
       Freshman    2019/9/25     0:05:13
       Freshman     2020/1/7     0:04:33
       Freshman    2019/9/23     0:04:31
       Freshman   2019/11/12     0:04:05
       Freshman     2019/9/8     0:03:33
       Freshman    2019/9/17     0:04:22
       Freshman   2019/10/19     0:05:26
       Freshman    2019/10/6     0:04:15
       Freshman    2019/12/6     0:04:23
B      Sophomore    2020/1/3     0:04:28
       Sophomore  2019/12/23     0:05:29
       Sophomore   2019/11/5     0:04:29
       Sophomore  2019/10/28     0:05:24
       Sophomore   2019/9/19     0:03:32

In [89]:
#筛选出体重大于50
df_multi.loc[df_multi.Weight > 50].head()

                          Name  Gender  Height  Weight Transfer  Test_Number  \
School Grade
A      Freshman      Qiang Chu  Female   162.5    52.0        N            1
       Freshman  Xiaopeng Zhou    Male   174.1    74.0        N            1
       Freshman     Yanpeng Lv    Male     NaN    65.0        N            1
       Freshman  Xiaopeng Zhao  Female   161.0    53.0        N            3
       Freshman    Chunli Zhao    Male   180.2    83.0        N            1

                  Test_Date Time_Record
School Grade
A      Freshman  2019/12/12     0:03:53
       Freshman   2019/9/29     0:05:16
       Freshman  2019/11/17     0:04:13
       Freshman   2019/9/25     0:05:13
       Freshman    2020/1/7     0:04:33

In [90]:
#查询行索引第一层为A，第二层为Freshman
df_multi.loc[lambda x:('A','Freshman')]

                          Name  Gender  Height  Weight Transfer  Test_Number  \
School Grade
A      Freshman   Gaopeng Yang  Female   158.9    46.0        N            1
       Freshman      Qiang Chu  Female   162.5    52.0        N            1
       Freshman  Xiaopeng Zhou    Male   174.1    74.0        N            1
       Freshman     Yanpeng Lv    Male     NaN    65.0        N            1
       Freshman  Xiaopeng Zhao  Female   161.0    53.0        N            3
       Freshman    Chunli Zhao    Male   180.2    83.0        N            1
       Freshman     Peng Zhang  Female   163.1     NaN        N            3
       Freshman   Xiaoquan Sun  Female   154.6    40.0        N            3
       Freshman    Chunmei Shi  Female   164.9    52.0        N            1
       Freshman   Xiaomei Yang  Female   159.3    49.0        N            1
       Freshman  Xiaofeng Qian  Female   158.5    49.0        N            1
       Freshman    Changmei Lv    Male   172.2    75.0        N            1
       Freshman     Qiang Feng    Male   178.9    80.0        N            2

                  Test_Date Time_Record
School Grade
A      Freshman   2019/10/5     0:04:34
       Freshman  2019/12/12     0:03:53
       Freshman   2019/9/29     0:05:16
       Freshman  2019/11/17     0:04:13
       Freshman   2019/9/25     0:05:13
       Freshman    2020/1/7     0:04:33
       Freshman   2019/9/23     0:04:31
       Freshman  2019/11/12     0:04:05
       Freshman    2019/9/8     0:03:33
       Freshman   2019/9/17     0:04:22
       Freshman  2019/10/19     0:05:26
       Freshman   2019/10/6     0:04:15
       Freshman   2019/12/6     0:04:23

# 多级索引的构造

In [91]:
my_tuple = [('a','cat'),('a','dog'),('b','cat'),('b','dog')]
my_tuple

[('a', 'cat'), ('a', 'dog'), ('b', 'cat'), ('b', 'dog')]

In [92]:
# from_tuples:传入的是列表，其元素使元组
pd.MultiIndex.from_tuples(my_tuple,names = ['first','second'])

MultiIndex([('a', 'cat'),
            ('a', 'dog'),
            ('b', 'cat'),
            ('b', 'dog')],
           names=['first', 'second'])

In [93]:
# from_arrays()传入的是列表
my_array = [list('aabb'),['cat','dog']*2]
my_array

[['a', 'a', 'b', 'b'], ['cat', 'dog', 'cat', 'dog']]

In [94]:
pd.MultiIndex.from_arrays(my_array,names = ['first','second'])

MultiIndex([('a', 'cat'),
            ('a', 'dog'),
            ('b', 'cat'),
            ('b', 'dog')],
           names=['first', 'second'])

In [95]:
# from_product() 指定的多个列表的笛卡尔积进行构造
my_list1 = ['a','b']
my_list2 = ['cat','dog']

In [96]:
pd.MultiIndex.from_product(
    [my_list1,
     my_list2],
     names = ['first','second']
)

MultiIndex([('a', 'cat'),
            ('a', 'dog'),
            ('b', 'cat'),
            ('b', 'dog')],
           names=['first', 'second'])

# 索引的常用方法

### 索引的交换和删除

In [97]:
# s索引层的交换
# 交换的轴是哪一个，要么是行索引，要么是列索引
# swaplevel()
df_ex.swaplevel(0,2,axis = 1).head() #交换表中列索引的第一列和第三列

NameError: name 'df_ex' is not defined

In [ ]:
# reorder_levels()
# 传入索引的位置，并进行交换
df_ex.reorder_levels([2,0,1],axis = 0).head() #将索引的0,1,2换位2,0,1

In [ ]:
#删除某一层的索引
# droplevel()
df_ex.droplevel(1,axis = 1) #删除列的第二行

In [ ]:
# 索引属性的修改
# rename_axis() 对索引层的名字进行修改,传入字典
df_ex.rename_axis(index = {'test1':'Y'},
                  columns = {'test4':'X'}).head()#将行的test1名字改为Y，列的test4名字改为X

In [ ]:
# 索引的重置
df_new = pd.DataFrame(
    {'A':list('aacd'),
     'B':list('QWER'),
     'C':[1,2,3,4]}
)
df_new

   A  B  C
0  a  Q  1
1  a  W  2
2  c  E  3
3  d  R  4

In [ ]:
df_new.set_index('A')

   B  C
A
a  Q  1
a  W  2
c  E  3
d  R  4

In [ ]:
# append 表示是否保持原本的索引，True 保留，False 不保留
df_new.set_index('A',append = True)

     B  C
  A
0 a  Q  1
1 a  W  2
2 c  E  3
3 d  R  4

In [ ]:
df_new.set_index(['A','B'])

     C
A B
a Q  1
  W  2
c E  3
d R  4

In [ ]:
# 索引的变形
df_reindex = pd.DataFrame({
    'Weight':[60,70,80],
    'Height':[170,176,180]},
    index = ['1001','1002','1003']
)
df_reindex

      Weight  Height
1001      60     170
1002      70     176
1003      80     180

In [ ]:
df_reindex.reindex(index = ['1001','1002','1003','1004'],
                   columns = ['Weight','X'])

      Weight   X
1001    60.0 NaN
1002    70.0 NaN
1003    80.0 NaN
1004     NaN NaN

# 分组

In [ ]:
# 语法格式：df.groupby(分组的依据)[数据来源].使用操作

In [ ]:
df = pd.read_csv('D:\\vscode_code\\数据集\\learn_pandas.csv')
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [ ]:
#按照性别统计身高中位数
# median():返回行或列的所有元素的中位数
df.groupby('Gender')['Height'].median()

Gender
Female    159.6
Male      173.4
Name: Height, dtype: float64

In [ ]:
#分组的本质:只需要在groupby函数中传入相应的列名,或者列名构成的列表即可。
# groupby分组依据从列中按名字进行获取即可
df.groupby(['School','Gender'])['Height'].mean()

School  Gender
A       Female    159.122500
        Male      176.760000
B       Female    158.666667
        Male      172.030000
C       Female    158.776923
        Male      174.212500
D       Female    159.753333
        Male      171.638889
Name: Height, dtype: float64

In [ ]:
condition = df.Weight > df.Weight.mean()
condition

0      False
1       True
2       True
3      False
4       True
       ...
195    False
196    False
197    False
198     True
199    False
Name: Weight, Length: 200, dtype: bool

In [ ]:
df.groupby(condition)['Height'].mean()

Weight
False    159.034646
True     172.705357
Name: Height, dtype: float64

In [ ]:
# eg: 使用随机传入字母序来验证以上结果
# choice():用于从给定的一维数组或列表中suiji选择元素
# 第一个参数可供选择的元素集合(列表)
# 第二个参数size表示要选择元素的次数
item = np.random.choice(list('abc'),df.shape[0])
df.groupby(item)['Height'].mean()

a    163.782609
b    162.432759
c    163.335714
Name: Height, dtype: float64

In [ ]:
# 将condition、item都传入groupby
df.groupby([condition,item])['Height'].mean()

Weight
False   a    159.068889
        b    158.575610
        c    159.456098
True    a    172.620833
        b    171.735294
        c    173.940000
Name: Height, dtype: float64

In [ ]:
# drop_duplicates()
df[['School','Gender']].drop_duplicates()

   School  Gender
0       A  Female
1       B    Male
2       A    Male
3       C  Female
4       C    Male
5       D  Female
9       B  Female
16      D    Male

In [ ]:
df.groupby([df['School'],df['Gender']])['Height'].mean()

School  Gender
A       Female    159.122500
        Male      176.760000
B       Female    158.666667
        Male      172.030000
C       Female    158.776923
        Male      174.212500
D       Female    159.753333
        Male      171.638889
Name: Height, dtype: float64

# groupby对象

In [ ]:
gb = df.groupby(['School','Grade'])
gb

In [ ]:
# 常用属性
# groups: 返回一个字典，该字典的键是分组的标签，值是每个组中元素的索引列表
res = gb.groups
res

{('A', 'Freshman'): [0, 6, 10, 60, 114, 117, 119, 121, 141, 148, 149, 153, 184], ('A', 'Junior'): [31, 42, 50, 56, 58, 64, 85, 93, 115, 122, 143, 155, 164, 172, 174, 188, 190], ('A', 'Senior'): [2, 12, 19, 21, 22, 23, 79, 87, 89, 103, 104, 109, 123, 134, 156, 161, 165, 166, 171, 192, 197, 198], ('A', 'Sophomore'): [13, 65, 71, 124, 167], ('B', 'Freshman'): [1, 32, 35, 36, 38, 45, 54, 57, 88, 96, 99, 140, 185], ('B', 'Junior'): [9, 20, 59, 72, 75, 102, 159, 183], ('B', 'Senior'): [30, 86, 116, 127, 130, 132, 147, 194], ('B', 'Sophomore'): [29, 61, 83, 101, 120], ('C', 'Freshman'): [15, 28, 63, 70, 73, 105, 108, 157, 186], ('C', 'Junior'): [26, 41, 82, 84, 90, 107, 145, 152, 173, 187, 189, 195], ('C', 'Senior'): [39, 46, 49, 52, 66, 77, 112, 129, 131, 138, 144], ('C', 'Sophomore'): [3, 4, 37, 48, 68, 98, 135, 170], ('D', 'Freshman'): [5, 8, 33, 34, 43, 44, 47, 51, 62, 67, 81, 111, 125, 133, 136, 142, 146], ('D', 'Junior'): [7, 11, 16, 17, 27, 69, 94, 95, 113, 118, 128, 137, 150, 154, 158, 160, 162, 163, 169, 176, 177, 191], ('D', 'Senior'): [14, 18, 24, 25, 78, 92, 100, 126, 168, 175, 179, 180, 193, 196], ('D', 'Sophomore'): [40, 53, 55, 74, 76, 80, 91, 97, 106, 110, 139, 151, 178, 181, 182, 199]}

In [ ]:
# ngroups:返回的分组数量,也就是分组后不同的组的个数
gb.ngroups

16

In [ ]:
# size()方法，返回每个组的大小，即每个组中元素的数量。它会返回一个series,索引是分组的标签,值是每个组的元素数量。
gb.size()

School  Grade
A       Freshman     13
        Junior       17
        Senior       22
        Sophomore     5
B       Freshman     13
        Junior        8
        Senior        8
        Sophomore     5
C       Freshman      9
        Junior       12
        Senior       11
        Sophomore     8
D       Freshman     17
        Junior       22
        Senior       14
        Sophomore    16
dtype: int64

In [ ]:
# get_group():用户获取指定的分组标签对应的组数据，返回的是DataFrame或者Series
gb.get_group(('A','Freshman')).iloc[:3,:3]

   School     Grade           Name
0       A  Freshman   Gaopeng Yang
6       A  Freshman      Qiang Chu
10      A  Freshman  Xiaopeng Zhou

In [ ]:
# 分组的三大操作：
# 1、聚合
# 2、变换
# 3、过滤

# 聚合

## 聚合的内置函数

In [ ]:
#max/min/mean/median/count/all/any/idxmax/idxmin/mad(Mean Absolute Deviation)/nunique/skew/quantile/sum/std/var/sem(Standard Error of the Mean)/size/prod

In [100]:
# max():计算每个组中的最大值
gb = df.groupby('Gender')['Height']
gb.max()

Gender
Female    170.2
Male      193.9
Name: Height, dtype: float64

In [101]:
#min()：计算每个组中的最小值
gb.min()

Gender
Female    145.4
Male      155.7
Name: Height, dtype: float64

In [103]:
#mean() 计算每个组中的平均数
gb.mean()

Gender
Female    159.19697
Male      173.62549
Name: Height, dtype: float64

In [104]:
#count() 计算每个组中的非空值的数量
gb.count()

Gender
Female    132
Male       51
Name: Height, dtype: int64

In [ ]:
# all() 计算每个组中是否所有值为true
gb.all()

Gender
Female    True
Male      True
Name: Height, dtype: bool

In [ ]:
#any() 计算组中是否至少有一个值为True
gb.any()

Gender
Female    True
Male      True
Name: Height, dtype: bool

In [107]:
#idxmax()组中最大值索引
gb.idxmax()

Gender
Female     28
Male      193
Name: Height, dtype: int64

In [108]:
#idxmin()组中最小值索引
gb.idxmax()

Gender
Female     28
Male      193
Name: Height, dtype: int64

In [ ]:
#mad()mean absolute deviation 平均绝对偏差
#每一组的平均绝对偏差
# gb.mad() 新版本pandas中没有

AttributeError: 'SeriesGroupBy' object has no attribute 'mad'

In [110]:
#nunique 每个组唯一值的数量
gb.nunique()

Gender
Female    99
Male      47
Name: Height, dtype: int64

In [111]:
# skew 每个组的偏度
gb.skew()

Gender
Female   -0.219253
Male      0.437535
Name: Height, dtype: float64

In [ ]:
# quantile() 每个组的分位数
gb.quantile(0.75)#每个组中的上四分位数

Gender
Female    162.825
Male      177.150
Name: Height, dtype: float64

In [113]:
#sum 每个组中所有值的总和
gb.sum()

Gender
Female    21014.0
Male       8854.9
Name: Height, dtype: float64

In [114]:
#std 每个组中的标准差
gb.std()

Gender
Female    5.053982
Male      7.048485
Name: Height, dtype: float64

In [115]:
# var() 每个组中的方差
gb.var()

Gender
Female    25.542739
Male      49.681137
Name: Height, dtype: float64

In [116]:
#sem() standard error of mean 平均标准误差
#每个组中的平均标准误差
gb.sem()

Gender
Female    0.439893
Male      0.986985
Name: Height, dtype: float64

In [117]:
#size() 每个组的大小
gb.size()

Gender
Female    141
Male       59
Name: Height, dtype: int64

In [118]:
#prod() 每组的乘积
gb.prod()

Gender
Female    4.232080e+290
Male      1.594210e+114
Name: Height, dtype: float64

In [ ]:
#agg 方法
# 它能对分组后的数据应用一个或者多个聚合函数，实现多样化的统计数据分析``

In [119]:
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [120]:
gb = df.groupby('Gender')[['Height','Weight']]
gb

In [121]:
#基本用法
#1、对单个列应用聚合函数
gb.agg({'Height':['mean'],'Weight':['mean']})

           Height     Weight
             mean       mean
Gender
Female  159.19697  47.918519
Male    173.62549  72.759259

In [122]:
# 2、对单个列应用多个聚合函数
gb.agg(['sum','idxmax','skew'])

         Height                   Weight
            sum idxmax      skew     sum idxmax      skew
Gender
Female  21014.0     28 -0.219253  6469.0     28 -0.268482
Male     8854.9    193  0.437535  3929.0      2 -0.332393

In [123]:
# 3、对多个列应用不同的聚合函数
gb.agg({'Height':['mean'],'Weight':['sum']})

           Height  Weight
             mean     sum
Gender
Female  159.19697  6469.0
Male    173.62549  3929.0

In [124]:
# 自定义函数
gb.agg(lambda x:x.mean() - x.min())

          Height     Weight
Gender
Female  13.79697  13.918519
Male    17.92549  21.759259

In [126]:
# eg:定义一个函数，如果组的指标均值，超过该指标的总体均值
def my_agg(s):
    res = 'High'
    if s.mean() <= df[s.name].mean():
        res = 'Low'
    return res
gb.agg(my_agg)

       Height Weight
Gender
Female    Low    Low
Male     High   High

In [127]:
# 5、聚合函数结果重命名
# 如果想要对结果进行重命名,只需要对上述的位置改写成元组。
# 元组的第一个元素为新的名字，元组的第二个元素为原来的函数
gb.agg([('range',lambda x:x.max() - x.min()),('my_sum','sum')])

       Height          Weight
        range   my_sum  range  my_sum
Gender
Female   24.8  21014.0   29.0  6469.0
Male     38.2   8854.9   38.0  3929.0

# 变换

### 变换函数与transform方法

In [ ]:
#cumcount/cummax/cummin/cumsum/cumprod
#cumcount:对每个分组内的元素进行编号
#cumsum():对每个分组内的数据进行累计求和
#cummax():对每个分组内的数据累计求最大值
#cummin():对每个分组内的数据累计求最小值
#cumprod():对每个分组内的数据累计乘积

In [128]:
gb = df.groupby('Gender')[['Height','Weight']]
gb

In [129]:
gb.cumcount()

0        0
1        0
2        1
3        1
4        2
      ...
195    138
196    139
197    140
198     57
199     58
Length: 200, dtype: int64

In [130]:
gb.cumsum()

      Height  Weight
0      158.9    46.0
1      166.5    70.0
2      355.4   159.0
3        NaN    87.0
4      529.4   233.0
..       ...     ...
195  20699.2  6374.0
196  20860.1  6424.0
197  21014.0  6469.0
198   8699.2  3878.0
199   8854.9  3929.0

[200 rows x 2 columns]

In [131]:
gb.cumprod()

            Height         Weight
0     1.589000e+02   4.600000e+01
1     1.665000e+02   7.000000e+01
2     3.145185e+04   6.230000e+03
3              NaN   1.886000e+03
4     5.472622e+06   4.610200e+05
..             ...            ...
195  1.709067e+286  1.350757e+223
196  2.749889e+288  6.753783e+224
197  4.232080e+290  3.039202e+226
198  1.023899e+112   4.980836e+98
199  1.594210e+114  2.540227e+100

[200 rows x 2 columns]

In [132]:
gb.cummax()

     Height  Weight
0     158.9    46.0
1     166.5    70.0
2     188.9    89.0
3       NaN    46.0
4     188.9    89.0
..      ...     ...
195   170.2    63.0
196   170.2    63.0
197   170.2    63.0
198   193.9    89.0
199   193.9    89.0

[200 rows x 2 columns]

In [133]:
gb.cummin()

     Height  Weight
0     158.9    46.0
1     166.5    70.0
2     166.5    70.0
3       NaN    41.0
4     166.5    70.0
..      ...     ...
195   145.4    34.0
196   145.4    34.0
197   145.4    34.0
198   162.4    55.0
199   155.7    51.0

[200 rows x 2 columns]

# transform 方法

In [ ]:
# 它可以对分组后的数据进行变换操作,与agg()方法不同,transform方法会返回一个与原数据具有相同索引的对象
# 其主要作用是将聚合函数应用到每个分组,并将其结果广播到每个分组内的元素上。

In [134]:
# 基本用户
# 1、对分组数据应用聚合函数
gb.mean()

           Height     Weight
Gender
Female  159.19697  47.918519
Male    173.62549  72.759259

In [135]:
gb.transform('mean').head()

      Height     Weight
0  159.19697  47.918519
1  173.62549  72.759259
2  173.62549  72.759259
3  159.19697  47.918519
4  173.62549  72.759259

In [136]:
# 2、自定义函数的应用
# lambda x:x.max() - x.min()
gb.transform(lambda x:x.max() - x.min()).head()

   Height  Weight
0    24.8    29.0
1    38.2    38.0
2    38.2    38.0
3    24.8    29.0
4    38.2    38.0

In [137]:
# 常用应用场景
# 1、数据标准化
gb.transform(lambda x:(x - x.mean()) / x.std()).head()

     Height    Weight
0 -0.058760 -0.354888
1 -1.010925 -0.355000
2  2.167063  2.089498
3       NaN -1.279789
4  0.053133  0.159631

In [139]:
# 缺失值填充
gb.transform(lambda x:x.fillna(x.mean())).count()

Height    200
Weight    200
dtype: int64

In [140]:
data = {
    'test1':['A','A','B','B'],
    'value': [10,np.nan,30,40]
}
df_demo = pd.DataFrame(data)
grouped = df_demo.groupby('test1')['value']
# 用每个分组的均值填充缺失数据
grouped.transform(lambda x:x.fillna(x.mean()))

0    10.0
1    10.0
2    30.0
3    40.0
Name: value, dtype: float64

# 过滤

## 组索引操作

In [142]:
# 1、获取分组索引
data = {
    'test1':['A','B','A','B'],
    'value':[10,20,15,25]
}
df_demo = pd.DataFrame(data)
df_demo

  test1  value
0     A     10
1     B     20
2     A     15
3     B     25

In [143]:
grouped = df_demo.groupby('test1')
grouped.groups

{'A': [0, 2], 'B': [1, 3]}

In [144]:
# 2.遍历分组索引
# 使用for循环遍历分组后的结果,获取每个分组的标签和对应的DataFrame
for group_label,group_df in grouped:
    print(f'分组的标签：{group_label}')
    print(group_df)
    print()

分组的标签：A
  test1  value
0     A     10
2     A     15

分组的标签：B
  test1  value
1     B     20
3     B     25

# 组过滤操作

In [145]:
# 1.使用filter()方法
# filter(): 方法用于根据自定义的条件过滤分组,返回一个满足条件的分组数据。filter()接受一个函数作为参数，该函数的输入是每个分组的DataFrame,返回的值为布尔类型。

# 定义一个函数:实现过滤条件分组的平均值大于12
# grouped = df_demo.groupby('test1')
# grouped['value'].mean()>12
def filter_con(group):
    return group['value'].mean() > 12

# 过滤分组
a_df = grouped.filter(filter_con)
print(a_df)

  test1  value
0     A     10
1     B     20
2     A     15
3     B     25

In [146]:
# 2、基于索引过滤分组
# 可以根据分组的标签选择特定分组
# eg：选择A分组
select_group = grouped.get_group('A')
print(select_group)

  test1  value
0     A     10
2     A     15